Courses/7140/Lectures/Examples/Game-Of-Life/solution.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Notes on Game of Life Assertions</title>
<!-- 2016-06-08 Wed 03:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CEG7380 Cloud Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Notes on Game of Life Assertions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. The Grid</a></li>
<li><a href="#sec-2">2. Initial State</a></li>
<li><a href="#sec-3">3. Next State</a></li>
<li><a href="#sec-4">4. Display</a></li>
<li><a href="#sec-5">5. Game Activity Control</a>
<ul>
<li><a href="#sec-5-1">5.1. Requirements</a></li>
<li><a href="#sec-5-2">5.2. User Interface</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Design Issues</a></li>
</ul>
</div>
</div>
<p>
I am writing informally but precisely.  For now, I am letting some
design issues spill into these assertions aimed at specifying
"things".
</p>

<p>
This HW1 is yet to be turned in.  So, there are quite a few things
that need to be filled out.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The Grid</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Define this as the (internal rep of the) grid of cells where our
organisms are.  The user views (a portion of) this grid subject to
the finite size limitations of the display.
</li>

<li>g: A grow/shrink 2D array of 0s and 1s.  Zero =&gt; not-alive. One =&gt;
alive.
</li>

<li>First index is y, second index is x.  For GoL, these x-, y-
coordinates can be negative integers also, and there are no
upper/lower bounds.
</li>

<li>We can define g.minx as least x such that for some y, g[y, x] == 1.
Intuitively, there is no live cell to the left-of minx.  At the
level of specs, this is a function taking g as input and computing
minx.  A design might maintain this as an integer variable.
</li>

<li>Define g.maxx, g.miny, g.maxy similarly.
</li>

<li>You are most likely creating g via new().  The result should be !=
null.  This should be part of the class invariant.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Initial State</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>What should we expect the g to be at the beginning?
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Next State</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>The important assertion in the GoL has to do with how the g.pre and
g.post are related for any method: g.post = GoL-rules(g.pre).
</li>

<li>There is a lot buried in the function named GoL-rules.  It should
be defined by cases corresponding to the rules of the game.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Display</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>aka: screen, monitor, window, &#x2026;
</li>

<li>d: a fixed size 2D array of 0s and 1s.  Zeros and ones interpreted
as in g.  d.minx == 0, d.miny=0.  d.maxx, and d.maxy are determined
by the monitor device.  The y-axis ("lines") increases downward,
top is 0.  The x-axis is normal (left-most is 0, right-most is
maxx).
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Game Activity Control</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>This usage of the word "activity" is unrelated to Android.
</li>
</ol>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Requirements</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li>This is <b>really</b> a requirements discussion.
</li>
<li>We would want to control the delay between consecutive updates of
the display.  Including pause/resume.
</li>
<li>What to do with "run away" clusters of cells?  A wicked problem!
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> User Interface</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li>Your choice.
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Design Issues</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>Map g to d: This is <b>one of the</b> difficult things in the design.
Do we have any guidance from "Requirements"?
</li>

<li>That d is mapped correctly with respect to g at all times is part
of the game invariant.
</li>

<li>The obvious thing is to scan the g[., .] bounded by g.min* to g.max*
and apply the rules of the game to compute the next state of g.
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-01-16
</div>
</body>
</html>
